/* 


Drizzle (Çisenti): Hafif yağmur damlaları.
Thunderstorm (Fırtına): Şimşek ve gök gürültülü fırtına.
Snow (Karlı): Kar yağışı.
Mist (Sisli): Yoğun sis.
Fog (Puslu): Puslu hava.
Haze (Hafif Sis): Hafif sisli hava.
Smoke (Dumanlı): Dumanlı hava.
Dust (Tozlu): Tozlu veya kumlu hava.
Sand (Kumlu): Kum fırtınası veya kumlu hava.
Ash (Kül): Yanan volkanik kül.
Squall (Fırtınalı): Kuvvet
*/

const clear = {
  svgPath:
    "M120,40V16a8,8,0,0,1,16,0V40a8,8,0,0,1-16,0Zm72,88a64,64,0,1,1-64-64A64.07,64.07,0,0,1,192,128Zm-16,0a48,48,0,1,0-48,48A48.05,48.05,0,0,0,176,128ZM58.34,69.66A8,8,0,0,0,69.66,58.34l-16-16A8,8,0,0,0,42.34,53.66Zm0,116.68-16,16a8,8,0,0,0,11.32,11.32l16-16a8,8,0,0,0-11.32-11.32ZM192,72a8,8,0,0,0,5.66-2.34l16-16a8,8,0,0,0-11.32-11.32l-16,16A8,8,0,0,0,192,72Zm5.66,114.34a8,8,0,0,0-11.32,11.32l16,16a8,8,0,0,0,11.32-11.32ZM48,128a8,8,0,0,0-8-8H16a8,8,0,0,0,0,16H40A8,8,0,0,0,48,128Zm80,80a8,8,0,0,0-8,8v24a8,8,0,0,0,16,0V216A8,8,0,0,0,128,208Zm112-88H216a8,8,0,0,0,0,16h24a8,8,0,0,0,0-16Z",
  imgPath: "/img/nikola-johnny-mirkovic-iCz02KEeJTs-unsplash.jpg",
};

const rain = {
  svgPath:
    "M158.66,196.44l-32,48a8,8,0,1,1-13.32-8.88l32-48a8,8,0,0,1,13.32,8.88ZM232,92a76.08,76.08,0,0,1-76,76H132.28l-29.62,44.44a8,8,0,1,1-13.32-8.88L113.05,168H76A52,52,0,0,1,76,64a53.26,53.26,0,0,1,8.92.76A76.08,76.08,0,0,1,232,92Zm-16,0A60.06,60.06,0,0,0,96,88.46a8,8,0,0,1-16-.92q.21-3.66.77-7.23A38.11,38.11,0,0,0,76,80a36,36,0,0,0,0,72h80A60.07,60.07,0,0,0,216,92Z",
  imgPath: "/img/max-bender-1YHXFeOYpN0-unsplash.jpg",
};

const clouds = {
  svgPath:
    "M160,40A88.09,88.09,0,0,0,81.29,88.67,64,64,0,1,0,72,216h88a88,88,0,0,0,0-176Zm0,160H72a48,48,0,0,1,0-96c1.1,0,2.2,0,3.29.11A88,88,0,0,0,72,128a8,8,0,0,0,16,0,72,72,0,1,1,72,72Z",
  imgPath: "/img/pexels-vicente-viana-martínez-2377432.jpg",
};

const fog = {
  svgPath:
    "M120,200H72a8,8,0,0,1,0-16h48a8,8,0,0,1,0,16Zm64-16H160a8,8,0,0,0,0,16h24a8,8,0,0,0,0-16Zm-24,32H104a8,8,0,0,0,0,16h56a8,8,0,0,0,0-16ZM232,92a76.08,76.08,0,0,1-76,76H76A52,52,0,0,1,76,64a53.26,53.26,0,0,1,8.92.76A76.08,76.08,0,0,1,232,92Zm-16,0A60.06,60.06,0,0,0,96,88.46a8,8,0,0,1-16-.92q.21-3.66.77-7.23A38.11,38.11,0,0,0,76,80a36,36,0,0,0,0,72h80A60.07,60.07,0,0,0,216,92Z",
  imgPath: "/img/pexels-sevil-yeva-15782584.jpg",
};

const VisualData = {
  Clear: clear,
  Rain: rain,
  Clouds: clouds,
  Fog: fog,
};
